package com.example.shoikat.birsrestho;

import android.os.Bundle;
import android.support.v4.view.PagerAdapter;
import android.support.v4.view.ViewPager;
import android.support.v7.app.ActionBarActivity;

import com.example.shoikat.birsrestho.ViewPager.ViewPagerAdapter2;

import java.util.ArrayList;


public class BirprotikActivity extends ActionBarActivity {

    // Declare Variables
    ViewPager viewPager;
    PagerAdapter adapter;

    ArrayList<String []> listNameArray;
    String[] rank;
    String[] name1,name2, name3, name4, name5, name6, name7, name8, name9, name10,
            name11, name12, name13, name14, name15, name16,name17, name18, name19, name20,
            name21,name22, name23, name24, name25, name26, name27;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_birprotik);

        listNameArray=new ArrayList<String[]>();


        // Generate sample data
        rank = new String[] { "1", "2", "3", "4", "5", "6", "7", "8", "9", "10",
                "11", "12", "13", "14", "15", "16", "17", "18", "19", "20",
                "21", "22", "23", "24", "25", "26", "27"};

        name1= new String[]{
                "০১| মোহাম্মদ আব্দুল মতিন", "০২| আবু তাহের সালাহ উদ্দিন", "০৩| মোহাম্মদ আবদুল মতিন",
                "০৪| মোহাম্মদ মতিয়ুর রহমান", "০৫| মোহাম্মদ আইন উদ্দিন", "০৬| আকবর হোসেন", "০৭| মোহাম্মদ নজরুল হক",
                "০৮| মোহাম্মদ বজলুল গনি পাটোয়ারী", "০৯| মোহাম্মদ আবদুর রশিদ", "১০| মোহাম্মদ শহিদুল ইসলাম",
                "১১| সৈয়দ মঈন উদ্দিন আহমেদ", "১২| আক্তার আহমেদ", "১৩| মোহাম্মদ আনোয়ার হোসেন",
                "১৪| দেলোয়ার হোসেন", "১৫| সেতারা বেগম", "১৬| মোহাম্মদ দিদারুল আলম"};

        name2= new String[]{"১৭| এ.এম. রাশেদ চৌধুরী", "১৮| সৈয়দ মুহাম্মদ ইবরাহিম", "১৯| এম হারুন-অর-রশিদ", "২০| ইবনে ফজল বদিউজ্জামান",
                "২১| মোহাম্মদ নজরুল ইসলাম ভূঁইয়া", "২২| হুমায়ুন কবির চৌধুরী", "২৩| মোহাম্মদ শফিক উল্লাহ",
                "২৪| সাজ্জাদ আলী জহির", "২৫| মাহবুব-উল-আলম", "২৬| সায়ীদ আহমেদ", "২৭| অলীক কুমার গুপ্ত",
                "২৮| মমতাজ হাসান", "২৯| কে. এম. আবু বাকের", "৩০| এম মিজানুর রহমান",
                "৩১| তাহের আহমেদ", "৩২| মঞ্জুর আহমেদ"};


        name3= new String[]{"৩৩| শামসুর আলম",  "৩৪| জামিল উদদীন আহ্‌সান", "৩৫| ওয়াকার হোসেন", "৩৬| মোহাম্মদ মাসুদুর রহমান",
                "৩৭| জহিরুল হক খান", "৩৮| মোহাম্মদ ওয়ালিউল ইসলাম", "৩৯| শওকত আলী", "৪০| মোদাচ্ছের হোসেন খান",
                "৪১| রওশন ইয়াজদানী ভুঁইয়া", "৪২| মোহাম্মদ জাহাংগীর ওসমান", "৪৩| মোহাম্মদ নূরুল হক",
                "৪৪| হারিস মিয়া", "৪৫| আবদুল মজিদ", "৪৬| মোহাম্মদ ইদ্রিস মিয়া", "৪৭| নূরুল আজিম চৌধুরী",
                "৪৮| মোহাম্মদ আলী"};

        name4= new String[]{
                 "৪৯| মোহাম্মদ আবুল বাশার", "৫০| আবদুল জব্বার",  "৫১| আলী নেওয়াজ", "৫২| মোহাম্মদ হাফিজ", "৫৩| জালাল আহমেদ",
                "৫৪| মোহাম্মদ শামসুল হক", "৫৫| আবুল হাকিম", "৫৬| করম আলী হাওলাদার", "৫৭| বদিউর রহমান",
                "৫৮| আবদুল জব্বার", "৫৯| আবুল হাসেম", "৬০| চাঁন মিয়া",  "৬১| এম. এ. মতিন চৌধুরী", "৬২| রসিব আলী", "৬৩| আফতাব আলী",
                "৬৪| আবদুল লতিফ"};



        name5= new String[]{"৬৫| আবুল হাসেম", "৬৬| মোহাম্মদ আবদুল মমিন", "৬৭| মোহাম্মদ আলতাফ হোসেন খান",
                "৬৮| মোহাম্মদ নাজিম উদ্দিন", "৬৯| মোহাম্মদ হোসেন", "৭০| মঙ্গল মিয়া",  "৭১| গাজী আবদুল জব্বার খান", "৭২| কবির আহমেদ", "৭৩| মোহাম্মদ আবদুল কুদ্দুস",
                "৭৪| গিয়াস উদ্দিন", "৭৫| মোহাম্মদ রেজাউল হক", "৭৬| মনসুর আলী", "৭৭| আবদুল জব্বার",
                "৭৮| হোসেন আলী তালুকদার", "৭৯| মুসলেহ উদ্দিন খান", "৮০| মনির আহমেদ খান"};


        name6= new String[]{"৮১| কাজী মোহাম্মদ আকমল আলী", "৮২| আলী আকবর আকন", "৮৩| আবুল কালাম",
                "৮৪| আবদুল হাই", "৮৫| তোফায়েল আহমেদ", "৮৬| সাইফ উদ্দিন",
                "৮৭| রুহুল আমিন", "৮৮| আবদুল গফুর", "৮৯| আবদুস সোবহান", "৯০| ওয়াজেদ আলী",  "৯১| শফিকুল ইসলাম",
                "৯২| আবদুল লতিফ ", "৯৩| মোজাম্মেল হক","৯৪| আবু তাহের", "৯৫| সিরাজুল হক", "৯৬| আবদুল আউয়াল"};

        name7= new String[]{
               "৯৭| মনিরুল ইসলাম","৯৮| মোসলেহ উদ্দিন", "৯৯| আবদুল মালেক", "১০০| সাহেব মিয়া",
               "১০১| নূর মোহাম্মদ", "১০২| মোহাম্মদ মকবুল হোসাইন", "১০৩| মুনির আহামদ",
               "১০৪| মিজানুর রহমান", "১০৫| সোমা মিঞা", "১০৬| মোহাম্মদ বিল্লাল উদ্দিন", "১০৭| সাইদুল আলম",
                "১০৮| আবদুল ওহাব", "১০৯| শহিদুল্লাহ", "১১০| আবদুল বাতেন খাসনা", "১১১| সিরাজুল হক", "১১২| আবদুল নূর",};


        name8= new String[]{"১১৩| মোহাম্মদ নাসির উদ্দিন", "১১৪| সিকান্দর আহমেদ", "১১৫| গোলাম মোস্তফা",
                "১১৬| আবুল কালাম","১১৭| আবুল বাশার", "১১৮| তাজুল ইসলাম", "১১৯| আবদুর রাজ্জাক", "১২০| অমিনুল ইসলাম",
                "১২১| আলিমূল ইসলাম", "১২২| মতিয়ুর রহমান", "১২৩| শাহাবুদ্দিন",
                "১২৪| শাহ জালাল আহমেদ", "১২৫| আলী আহমেদ খান", "১২৬| আবদুল মান্নান", "১২৭| মোহাম্মদ ইদ্রিস",
                "১২৮| আবদুল মান্নান"};

        name9= new String[]{
               "১২৯| বশির আহমেদ", "১৩০| হাসেম",  "১৩১| আবদুল বাতেন", "১৩২| আবদুল খালেক", "১৩৩| আবদুল মজিদ",
                "১৩৪| মোহাম্মদ আমিন উল্লাহ", "১৩৫| গোলাম মোস্তফা", "১৩৬| মোহাম্মদ সিদ্দিক", "১৩৭| এ.টি.এম. ফসিউল আলম",
                "১৩৮| মোহাম্মদ ইসমাইল", "১৩৯| খলিলুর রহমান খান", "১৪০| মোহাম্মদ মোস্তফা",  "১৪১| আবদুল ওয়াহিদ",
                "১৪২| ফারুক আহমেদ পাটোয়ারী", "১৪৩| এনামুল হক",
                "১৪৪| মোহাম্মদ এজাজুল হক খান"};

        name10= new String[]{
               "১৪৫| আসাদ মিয়া", "১৪৬| দেলোয়ার হোসাইন", "১৪৭| আবদুল কাদের",
                "১৪৮| আবদুল বাসেত", "১৪৯| কাজী মোরশেদুল আলম", "১৫০| আবদুল কুদ্দুস",
                "১৫১| আবু মুসলিম", "১৫২| রফিকুল ইসলাম", "১৫৩| বজলু মিয়া",
                "১৫৪| কামাল উদ্দিন", "১৫৫| আমির হোসেন", "১৫৬| মোহাম্মদ ইসহাক", "১৫৭| বাদশা মিঞা",
                "১৫৮| হারুন-অর-রশীদ", "১৫৯| আজিজুল হক", "১৬০| মোশাররফ হোসেন"};

        name11= new String[]{
                "১৬১| জুলফু মিঞা", "১৬২| আবদুল কুদ্দুস গাজী", "১৬৩| ওয়ালীউল হোসেন",
                "১৬৪| সিরাজুল ইসলাম", "১৬৫| আলী আকবর", "১৬৬| বাচ্চু মিঞা", "১৬৭| আবদুস সালাম",
                "১৬৮| মোহাম্মদ ওসমান গনি", "১৬৯| মুজাফফর আহমেদ", "১৭০| তোবারক উল্লাহ",
                "১৭১| আবদুল জলিল", "১৭২| খায়রুল বাশার খান", "১৭৩| হাসান উদ্দিন আহমেদ",
                "১৭৪| গোলাম মোস্তফা", "১৭৫| আহমেদ হোসেন", "১৭৬| আবদুল মালেক",};

        name12= new String[]{"১৭৭| গোলাম হোসেন",
                "১৭৮| মাজহারুল হক", "১৭৯| খোরশেদ আলম", "১৮০| মোহাম্মদ আবদুল গনি",
                "১৮১| এস.এ. সিদ্দিকী", "১৮২| আহসান উল্লাহ", "১৮৩| শেখ সোলায়েমান",
                "১৮৪| আয়েজউদ্দিন আহমেদ", "১৮৫| আবদুর রউফ মজুমদার", "১৮৬| মোহাম্মদ লনি মিয়া দেওয়ান", "১৮৭| আবদুল মালেক চৌধুরী",
                "১৮৮| নূরুল হুদা", "১৮৯| মকবুল আলী", "১৯০| মমতাজ মিয়া","১৯১| মালু মিয়া", "১৯২| আবু তাহের", };




        name13= new String[]{
                "১৯৩| মোহাম্মদ ইব্রাহিম","১৯৪| মোবারক হোসেন", "১৯৫| আবদুল হালিম", "১৯৬| সৈয়দ খান", "১৯৭| আবদুর রউফ শরীফ",
                "১৯৮| আবুল হাসেম", "১৯৯| আবদুল হামিদ", "২০০| আবদুল আওয়াল",  "২০১| আজিজুর রহমান", "২০২| ফজলুল হক", "২০৩| ওয়াজি উল্লাহ",
                "২০৪| লুৎফর রহমান", "২০৫| আবদুর রহমান", "২০৬| খলিলুর রহমান", "২০৭| আসাদ আলী", "২০৮| আবদুর রশীদ",};

        name14= new String[]{"২০৯| আবুল হোসেন", "২১০| আবদুল গাফফার", "২১১| কাসেম আলী হাওলাদার",
                "২১২| মোহাম্মদ ইয়াকুব আলী", "২১৩| সায়েদুল হক",
                "২১৪| মোহাম্মদ লোকমান", "২১৫| আবদুল মান্নান খান", "২১৬| আবদুল ওয়াহিদ", "২১৭| শফিক উদ্দিন আহমেদ",
                "২১৮| নজরুল ইসলাম", "২১৯| আতাহার আলী", "২২০| আহমদুর রহমান",  "২২১| আবদুল মালেক",
                "২২২| জাকির হোসেন", "২২৩| মোকতার আলী",
                "২২৪| রশিদ আলী", };


        name15= new String[]{"২২৫| আবদুল ওয়াজেদ", "২২৬| হাবিবুর রহমান", "২২৭| তোফায়েল আহমেদ",
                "২২৮| দুদু মিঞা", "২২৯| আলী আকবর মিজি", "২৩০| আতাউর রহমান", "২৩১| আবদুল হক", "২৩২| সফিকুর রহমান", "২৩৩| দেলোয়ার হোসেন",
                "২৩৪| দেলোয়ার হোসেন", "২৩৫| মফিজুর রহমান", "২৩৬| নান্নু মিয়া", "২৩৭| মোস্তফা কামাল",
                "২৩৮| গাজী আবদুল ওয়াহিদ", "২৩৯| ফোরকান উদ্দিন", "২৪০| আবদুল জব্বার"};


        name16= new String[]{
                "২৪১| সিরাজুল ইসলাম", "২৪২| মোহাম্মদ রবি উল্লাহ", "২৪৩| তাজুল ইসলাম",
                "২৪৪| ইউসুফ আলী", "২৪৫| আবদুর রহমান", "২৪৬| আবদুল হাই", "২৪৭| মোহাম্মদ মাখন খান",
                "২৪৮| মোহাম্মদ শাহজাহান", "২৪৯| শামসুল হক", "২৫০| রবিউল হক", "২৫১| মোহাম্মদ শরীফ",
                "২৫২| নূরুল হক", "২৫৩| গুল মোহাম্মদ ভুঁইয়া",
                "২৫৪| আবদুল মান্নান", "২৫৫| ইলিয়াসুর রহমান", "২৫৬| আবদুল জলিল"};

        name17= new String[]{"২৫৭| সাজিদুর রহমান","২৫৮| ফারুক লস্কর", "২৫৯| আবদুল মালেক", "২৬০| জাহাঙ্গীর হোসেন",
                "২৬১| বাচ্চু মিয়া", "২৬২| ওহাব", "২৬৩| আবুল হাসেম",
                "২৬৪| আলী আকবর", "২৬৫| আবু সালেক", "২৬৬| হযরত আলী", "২৬৭| আশরাফ আলী খান",
                "২৬৮| তরিকুল ইসলাম", "২৬৯| সফি উদ্দিন", "২৭০| সাইদুর রহমান", "২৭১| ইদ্রিস",
                "২৭২| মোহাম্মদ নজরুল ইসলাম"};


        name18= new String[]{"২৭৩| রহমত উল্লাহ","২৭৪| মোহাম্মদ নজরুল ইসলাম", "২৭৫| আবদল আউয়াল সরকার",
                "২৭৬| মোফাজ্জল হোসেন", "২৭৭| এ.এস. ভুঁইয়া","২৭৮| আহসান উল্লাহ",
                "২৭৯| এম. সদর উদ্দিন", "২৮০| এম. হামিদউল্লাহ খান",  "২৮১| শহিদুল্লাহ", "২৮২| এস এম নুরুল হক", "২৮৩| রুস্তম আলী", "২৮৪| সৈয়দ রফিকুল ইসলাম", "২৮৫| কাজী জয়নাল আবেদীন",
                "২৮৬| আলী আশরাফ", "২৮৭| নজরুল ইসলাম", "২৮৮| এস কে আজিজুর রহমান"};

        name19= new String[]{"২৮৯| রেজওয়ান আলী", "২৯০| হেলালউজ্জামান",   "২৯১| রতন শরীফ", "২৯২| মোহাম্মদ সোলায়মান", "২৯৩| নাজিম উদ্দিন", "২৯৪| ফারুক-ই-আজম", "২৯৫| মোহাম্মদ খোরশেদ আলম", "২৯৬| মোহাম্মদ নুরুল হক",
                "২৯৭| মোহাম্মদ আমির হোসেন", "২৯৮| এস.এম. মাওলা", "২৯৯| এ.কে.এম. ইসহাক", "৩০০| মোহাম্মদ হোসেন",  "৩০১| মোহাম্মদ মতিউর রহমান", "৩০২| মোহাম্মদ শাহজাহান কবির",
                "৩০৩| মমিনউল্লাহ পাটোয়ারী", "৩০৪| এ.এস.এম.এ. খালেক" };


        name20= new String[]{"৩০৫| কাজী আবদুস সাত্তার", "৩০৬| আবদুল মুকিত", "৩০৭| গিয়াস উদ্দিন",
                "৩০৮| গোলাম দস্তগীর গাজী", "৩০৯| মুসুরুল আলম দুলাল", "৩১০| এ কে এম জয়নাল আবেদিন খান",
                "৩১১| মোহাম্মদ জিয়া", "৩১২| মুহাম্মদ জাকির", "৩১৩| বজলুল মাহমুদ", "৩১৪| শেখ আবদুল মান্নান",
                "৩১৫| হাবিবুল আলম", "৩১৬| এ.এম. মো: ইসহাক", "৩১৭| উইলিয়াম আব্রাহাম সাইমন ঔডারল্যান্ড",
                "৩১৮| মোহাম্মদ আবদুল আজিজ", "৩১৯| খায়রুল", "৩২০| সেলিম আকবর"};

        name21= new String[]{"৩২১| মোহাম্মদ আবদুল্লাহিল বাকী", "৩২২| মোহাম্মদ মোজাম্মেল হক", "৩২৩| নোয়াই মিঞা", "৩২৪| মানিক",
                "৩২৫| শামসুল হক ফিটার", "৩২৬| আনোয়ার হোসেন", "৩২৭| আবদুল মমিন", "৩২৮| আলমগীর কবির",
                "৩২৯| আবদুল হোসেন", "৩৩০| মোহাম্মদ শহীদুল্লাহ", "৩৩১| নূরুল হক", "৩৩২| রফিকুল ইসলাম", "৩৩৩| মনিনুল হক ভুঁইয়া",
                "৩৩৪| মোহাম্মদ ইব্রাহীম", "৩৩৫| সিরাজ উদ্দিন", "৩৩৬| মোহাম্মদ তৈয়ব আলী"};

        name22= new String[]{
                "৩৩৭| আবদুস সামাদ", "৩৩৮| বাহারউদ্দিন রেজা", "৩৩৯| জামাল কবির", "৩৪০| মোহাম্মদ আশরাফ",
                "৩৪১| মোহাম্মদ আবদুস সালাম", "৩৪২| এ কে এম রফিকুল হক", "৩৪৩| নূরুল ইসলাম খান পাঠান", "৩৪৪| শাহজাহান মজুমদার",
                "৩৪৫| এ.কে.এম. মির্জা উদ্দিন", "৩৪৬| মাহফুজুর রহমান", "৩৪৭| আমির হোসেন",
                "৩৪৮| মায়েজুল ইসলাম", "৩৪৯| এ.কে.এম. আতিকুল ইসলাম", "৩৫০| আশরাফুল হক",  "৩৫১| মাহবুবুর রব সাদী",
                "৩৫২| রফিক উদ্দিন"};


        name23= new String[]{
               "৩৫৩| নূরু উদ্দিন আহমেদ", "৩৫৪| সিরাজুল ইসলাম", "৩৫৫| মোহাম্মদ আবদুল মজিদ", "৩৫৬| ফখরুদ্দিন চৌধুরী", "৩৫৭| এম.এ. হালিম", "৩৫৮| এনামুল হক চৌধুরী", "৩৫৯| মোহাম্মদ ইদ্রিস আলী",
                "৩৬০| মোহাম্মদ বদরুজ্জামান মিয়া","৩৬১| হারিস উদ্দিন সরকার", "৩৬২| আবদুল হাই সরকার", "৩৬৩| এম.এ. সরকার",
                "৩৬৪| এ.কে. মাহবুবুর রহমান", "৩৬৫| মোহাম্মদ মহসিন আলী সরকার", "৩৬৬| মোহাম্মদ আজাদ আলী",
                "৩৬৭| মোহাম্মদ নূর হামিম", "৩৬৮| মোহাম্মদ বদিউজ্জামান (টনু ভাই)"};

        name24= new String[]{"৩৬৯| গোলাম আজাদ", "৩৭০| মোহাম্মদ সরদার উদ্দিন আহমেদ", "৩৭১| আব্দুর রহিম",
                "৩৭২| নাসির উদ্দিন", "৩৭৩| হাবিবুর রহমান", "৩৭৪| নজরুল ইসলাম", "৩৭৫| হারুনুর রশীদ (বীর প্রতীক)",
                "৩৭৬| আবদুল মালেক", "৩৭৭| হাজারী লাল তরফদার", "৩৭৮| শামসুদ্দিন আহমেদ", "৩৭৯| ইশতিয়াক হোসেন",
                "৩৮০| কে.এম. রফিকুল ইসলাম",  "৩৮১| দিদার আলী", "৩৮২| মোহাম্মদ গোলাম ইয়াকুব", "৩৮৩| আবদুল আলীম", "৩৮৪| কুদ্দুস মোল্লা"};

        name25= new String[]{"৩৮৫| আনোয়ার হোসেন", "৩৮৬| রফিকুল আহসান", "৩৮৭| কে.এস.এ মহিউদ্দিন (মানিক)", "৩৮৮| রফিকুল ইসলাম",
                "৩৮৯| দেবদাস বিশ্বাস (খোকন)", "৩৯০| এ.টি.এম. খালেদ","৩৯১| জহিরুল হক মুন্সী",
                "৩৯২| মোহাম্মদ আনিসুর রহমান", "৩৯৩| আবদুল মজিদ",
                "৩৯৪| মোছা: তারামন বেগম", "৩৯৫| শহীদুল হক ভুঁইয়া", "৩৯৬| মোহাম্মদ নূরুল ইসলাম",
                "৩৯৭| বশীর আহমেদ", "৩৯৮| আনিছুল হক আখন্দ", "৩৯৯| মতিউর রহমান", "৪০০| জহুরুল হক মুন্সি"};

        name26= new String[]{"৪০১| আবুল কালাম", "৪০২| মোহাম্মদ মাহবুব এলাহী রঞ্জু", "৪০৩| এ.টি.এম. খালেদ",
                "৪০৪| মোহাম্মদ নূরুল হক", "৪০৫| আবদুল্লাহ আল মাহমুদ", "৪০৬| বাহার", "৪০৭| সৈয়দ সদরুজ্জামান",
                "৪০৮| বেলাল হোসেন", "৪০৯| মোহাম্মদ এনায়েত হোসেন", "৪১০| ওয়ারেশাত হোসেন (বিলাল)", "৪১১| সাখাওয়াৎ হোসেন",
                "৪১২| মিজানুর রহমান", "৪১৩| হাবিবুর রহমান তালুকদার", "৪১৪| খোরশেদ আলম তালুকদার", "৪১৫| মোহাম্মদ ফজলুল হক","৪১৬| মোহাম্মদ আবদুল গফুর"};

        name27= new String[]{"৪১৭| মোহাম্মদ আবদুল্লাহ", "৪১৮| মোহাম্মদ আবদুল হাকিম", "৪১৯| সৈয়দ গোলাম মোস্তফা", "৪২০| আনোয়ার হোসেন পাহাড়ী",
                "৪২১| সাইদুর রহমান", "৪২২| মোহাম্মদ হামিদুল হক", "৪২৩| ফয়েজুর রহমান ফুল", "৪২৪| মোহাম্মদ খসরু মিয়া", "৪২৫| শহীদুল ইসলাম","৪২৬| আনিছুর রহমান"};


        listNameArray.add(name1);
        listNameArray.add(name2);
        listNameArray.add(name3);
        listNameArray.add(name4);
        listNameArray.add(name5);
        listNameArray.add(name6);
        listNameArray.add(name7);
        listNameArray.add(name8);
        listNameArray.add(name9);
        listNameArray.add(name10);
        listNameArray.add(name11);
        listNameArray.add(name12);
        listNameArray.add(name13);
        listNameArray.add(name14);
        listNameArray.add(name15);
        listNameArray.add(name16);
        listNameArray.add(name17);
        listNameArray.add(name18);
        listNameArray.add(name19);
        listNameArray.add(name20);
        listNameArray.add(name21);
        listNameArray.add(name22);
        listNameArray.add(name23);
        listNameArray.add(name24);
        listNameArray.add(name25);
        listNameArray.add(name26);
        listNameArray.add(name27);



        // Locate the ViewPager in viewpager_main.xml
        viewPager = (ViewPager) findViewById(R.id.pager);
        // Pass results to ViewPagerAdapter Class
        adapter = new ViewPagerAdapter2(BirprotikActivity.this, rank, listNameArray);
        // Binds the Adapter to the ViewPager
        viewPager.setAdapter(adapter);






    }
}
